create_clock -period 3 clk

#set_input_delay 0 -from [all_inputs] -clock clk
#set_output_delay 0 -to [all_outputs] -clock clk
