create_clock -period 1.0 clk

set_input_delay 0 -clock clk
set_output_delay 0 -clock clk
